
import {
    createStore
} from "redux";

const data = {
    arr: [{
        id: '1',
        img: '/image/conferance.jpg',
        body: 'Կրթության, գիտության, մշակույթի և սպորտի նախարար Վահրամ Դումանյանն այսօր ընդունել է ՀՀ-ում Եվրոպայի Խորհրդի գրասենյակի ղեկավար Մարտինա Շմիդտին: Հանդիպմանը ներկա է եղել նաև ԿԳՄՍ նախարարի տեղակալ Արթուր',
        name: 'Խթանելով ընթերցանությունը. «օրվա հաղթողները» պարգևատրվել են խրախուսական նվերներով',
        date: '25 Փետրվար 2022'

    }, {
        id: '2',
        img: '/image/conferance1.jpg',
        body: 'Կրթության, գիտության, մշակույթի և սպորտի նախարար Վահրամ Դումանյանն այսօր ընդունել է ՀՀ-ում Եվրոպայի Խորհրդի գրասենյակի ղեկավար Մարտինա Շմիդտին: Հանդիպմանը ներկա է եղել նաև ԿԳՄՍ նախարարի տեղակալ Արթուր',
        name: 'Խթանելով ընթերցանությունը. «օրվա հաղթողները» պարգևատրվել են խրախուսական նվերներով',
        date: '25 Փետրվար 2022'

        }, {
        id: '3',
        img: '/image/conferance2.jpg',
        body: 'Կրթության, գիտության, մշակույթի և սպորտի նախարար Վահրամ Դումանյանն այսօր ընդունել է ՀՀ-ում Եվրոպայի Խորհրդի գրասենյակի ղեկավար Մարտինա Շմիդտին: Հանդիպմանը ներկա է եղել նաև ԿԳՄՍ նախարարի տեղակալ Արթուր',
        name: 'Խթանելով ընթերցանությունը. «օրվա հաղթողները» պարգևատրվել են խրախուսական նվերներով',
        date: '25 Փետրվար 2022'

        }, {
        id: '4',
        img: '/image/conferance3.jpg',
        body: 'Կրթության, գիտության, մշակույթի և սպորտի նախարար Վահրամ Դումանյանն այսօր ընդունել է ՀՀ-ում Եվրոպայի Խորհրդի գրասենյակի ղեկավար Մարտինա Շմիդտին: Հանդիպմանը ներկա է եղել նաև ԿԳՄՍ նախարարի տեղակալ Արթուր',
        name: 'Խթանելով ընթերցանությունը. «օրվա հաղթողները» պարգևատրվել են խրախուսական նվերներով',
        date: '25 Փետրվար 2022'

        }, {
        id: '5',
        img: '/image/conferance4.jpg',
        body: 'Կրթության, գիտության, մշակույթի և սպորտի նախարար Վահրամ Դումանյանն այսօր ընդունել է ՀՀ-ում Եվրոպայի Խորհրդի գրասենյակի ղեկավար Մարտինա Շմիդտին: Հանդիպմանը ներկա է եղել նաև ԿԳՄՍ նախարարի տեղակալ Արթուր',
        name: 'Խթանելով ընթերցանությունը. «օրվա հաղթողները» պարգևատրվել են խրախուսական նվերներով',
        date: '25 Փետրվար 2022'

        }, {
        id: '6',
        img: '/image/conferance5.jpg',
        body: 'Կրթության, գիտության, մշակույթի և սպորտի նախարար Վահրամ Դումանյանն այսօր ընդունել է ՀՀ-ում Եվրոպայի Խորհրդի գրասենյակի ղեկավար Մարտինա Շմիդտին: Հանդիպմանը ներկա է եղել նաև ԿԳՄՍ նախարարի տեղակալ Արթուր',
        name: 'Խթանելով ընթերցանությունը. «օրվա հաղթողները» պարգևատրվել են խրախուսական նվերներով',
        date: '25 Փետրվար 2022'

        },

    ],
    universArr:[{
        id: '1',
        img: '/image/uni1.jpg',
        body: 'Կրթության, գիտության, մշակույթի և սպորտի նախարար Վահրամ Դումանյանն այսօր ընդունել է ՀՀ-ում Եվրոպայի Խորհրդի գրասենյակի ղեկավար Մարտինա Շմիդտին: Հանդիպմանը ներկա է եղել նաև ԿԳՄՍ նախարարի տեղակալ Արթուր',
        name: 'Խթանելով ընթերցանությունը. «օրվա հաղթողները» պարգևատրվել են խրախուսական նվերներով',
        date: '25 Փետրվար 2022'

    }


    ],
bool: false



}
const reducer = (state = data, action) => {
    const temp = {
        ...state
    };
    switch (action.type) {
        case "addToMedacin":
            if (temp.arr.find(e => { return e.id == action.val.medId })) {
                temp.arr.map((e) => { e.medacine?.push(action.val); console.log(e); })

            }
            break;
        case "add":
            temp.arr.push(action.med)
            break
        case "search":
            if (temp.arr.find(e => { return e.name.includes(action.val) })) {
                temp.bool = true

            }
            else {
                temp.bool = false
            }
            break

    }
    return temp
}


const add = (obj) => {
    return {
        type: "add",
        med: obj
    }
}

const addToMedacin = (obj) => {
    return {
        type: "addToMedacin",
        val: obj
    }
}

const search = (x) => {
    return {
        type: "search", val: x

    }
}

const store = createStore(reducer)

export {
    store,
    add, addToMedacin, search
}